import React from 'react';
import 'bootstrap/dist/css/bootstrap.min.css';
import { FaArrowRight, FaBook } from "react-icons/fa";
import { useNavigate } from 'react-router-dom';
const DayOfDetails = () => {
  const navigate = useNavigate();
  return (
    <div className="   px-5 text-right  " style={{ direction: "rtl",backgroundColor:"#1a1f2c",paddingTop:"100px" }}>


       <div className="py-4 " style={{position:"absolute",right:"10px ",position:"fixed"}}>
       <button onClick={() => navigate(-1)} className="btn btn-dark   ">
            <FaArrowRight className="fs-4" />  
          </button>
       </div>
      <h1 className="text-light text-center mb-4" > كيف كان الرسول يقضي يومه؟ ” الإنسان الكامل “</h1>
      <hr />

     <div className=" mt-5">
     <p className="lead text-light ">
        كيف كان الرسول يقضي يومه، رسول الله -صلّى الله عليه وسلّم- هو القدوة لكل مسلمٍ صادقٍ في إسلامه، قال الله تعالى:
        <span className="text-warning  font-weight-bold fs-1 "><br /> 
          {" "}لَّقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّـهِ أُسْوَةٌ حَسَنَةٌ لِّمَن كَانَ يَرْجُو اللَّـهَ وَالْيَوْمَ الْآخِرَ وَذَكَرَ اللَّـهَ كَثِيرًا.
        </span>
      </p>

      </div>

      <h3 className="mt-4 text-secondary">🕌 أعمال الرسول اليومية</h3>

      <div className="my-4 p-3 border rounded bg-light">
        <h5 className="text-dark">وقت صلاة الفجر:</h5>
        <p className="text-muted">
          كان رسول الله -صلّى الله عليه وسلّم- يصلّي الفجر في المسجد مع أصحابه، ويجلس في مصلّاه يذكر الله إلى شروق الشمس، 
          وكان الصحابة يجلسونه ويتذكّرون ما كان في أيام الجاهلية، فيتسامرون ويضحكون، وكان يدور على زوجاته، ويعود عند أوّل وقت صلاة الضحى إلى المسجد، 
          ليعلّم أصحابه ويرشدهم، وقد ينجز ما عليه فعله من أموره الخاصة.
        </p>
      </div>

      <div className="my-4 p-3 border rounded bg-light">
        <h5 className="text-dark">وقت صلاة الضحى:</h5>
        <p className="text-muted">
          يصلّي النبيّ نافلة الضحى، فقد روت السيدة عائشة -رضي الله عنها-: (كَانَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي الضُّحَى أَرْبَعًا، وَيَزِيدُ مَا شَاءَ اللهُ)، 
          القيلولة: كان النبيّ -صلى الله عليه وسلم- إذا ارتفعت الشمس وقبل وقت الظهر؛ نام القيلولة؛ لتساعده على التهجّد وقيام الليل، ويقول: «قِيلُوا، فإنَّ الشياطينَ لا تَقِيلُ».
        </p>
      </div>

      <div className="my-4 p-3 border rounded bg-light">
        <h5 className="text-dark">وقت صلاة الظهر:</h5>
        <p className="text-muted">
          كان يستيقظ من القيلولة وقت صلاة الظهر، فيخرج للمصلّى ويصلّي بالناس، وإن كان هناك أمرٌ يريد أن يخبره للمسلمين فإنّه يجتمع بهم، 
          فإذا فرغ عاد إلى بيته ليصلّي فيه سنّة الظهر، وقد يعود ليجالس أصحابه، أو يذهب لقضاء حاجاته.
        </p>
      </div>

      <div className="my-4 p-3 border rounded bg-light">
        <h5 className="text-dark">وقت صلاة العصر:</h5>
        <p className="text-muted">
          كان النبيّ يحرص على أدائها في أوّل وقتها، ثمّ يأخذ جولةً أخرى على زوجاته، وقد يحضُرن عنده فيجلسْن معه، ويمضي هذه الفترة من اليوم مع أسرته.
        </p>
      </div>

      <div className="my-4 p-3 border rounded bg-light">
        <h5 className="text-dark">وقت صلاة العشاء:</h5>
        <p className="text-muted">
          إذا دخل وقت صلاة العشاء، صلّى النبي مع أصحابه، فإن كان هناك أمرٌ مهمٌ من أمور المسلمين، جلس مع أصحابه وتشاوروا فيما بينهم، وإن لم يكن جلس مع أهله يسامرهم ويُحادثهم، 
          وكان -عليه الصلاة والسلام- حسن المعشر، بشوش الوجه، تجتمع نساؤه في بيت من أراد أن يبيت عندها، يجلسون معاً، ويتناولون العشاء إن أراد، 
          ويتحدّث النبيّ إليهنّ، ويستأنس بهنّ، ثمّ تنصرف كل واحدة منهنّ إلى حجرتها.
        </p>
      </div>

      <div className="my-4 p-3 border rounded bg-light">
        <h5 className="text-dark">قيام الليل:</h5>
        <p className="text-muted">
          كان ينام النبيّ في أول اللّيل، ثم يستيقظ للقيام ما يقرب من ثلث الليل، حتى إذا بقي من الليل السُّدس، عاد إلى نومه حتى يؤذّن بلال -رضي الله عنه- لصلاة الصبح، 
          فيصلّي رسول الله ركعتين ويخرج للصلاة.
        </p>
      </div>



<div className=''>

 <div className="my-4 p-3 border rounded bg-light">
 <h5 className="text-dark">في شهر رمضان:</h5>
<p  className="text-muted">ن النبي ينوي الصيام كل يوم، ويتسحر مع إحدى زوجاته، ثم يصلي سنة الصبح ركعتين خفيفتين، حتى يستأذنه بلال في إقامة الصلاة فيخرج فيصلي بالناس صلاة الصبح، ثم يجلس في يذكر الله تعالى حتى تطلع الشمس ثم يصلي ركعتين.
ثم يكون في بيته مع زوجاته في خدمتهم، بل كان يلاطفهن ويداعبهن، ثم إذا كان قبل المغرب كان يذكر الله ويدعوه، فإذا أذن المغرب أفطر على رطبات، فإن لم يجد حسا حسوات من ماء، ثم يصلي الفريضة في المسجد، ثم يعود ويجلس مع زوجاته، حتى إذا أذن العشاء خرج يؤم الناس.
أما عن قيامه لليل: فقالت السيدة عائشة – رضي الله عنها: (ما كان يزيد في رمضان ولا في غيره على إحدى عشرة ركعة فلا تسل عن حسنهن وطولهن).
وكان يكثر من قراءة القرآن والصلاة والذكر والصدقة على الفقراء والمساكين، كما كان النبي صلى الله عليه وسلم يعتكف في المسجد في العشر الأواخر في رمضان، وكان يحب كثرة الدعاء، وعن عائشة – رضي الله عنها -: قالت: قلت: يا رسول الله إن وافقت ليلة القدر، ما أدعو به؟ قال: قولي: «اللهم إنك عفو كريم تحب العفو فاعف عني».</p>


 </div>


 <div className="my-4 p-3 border rounded bg-light">
 <h5>ماذا كان يفعل الرسول بعد صلاة الفجر</h5>
<p>بعد صلاة الفجر، كان الرسول محمد صلى الله عليه وسلم يمارس عدة أنشطة وفقًا للأحاديث النبوية، وتشمل:

الجلوس في مكانه حتى الإشراق: كان يستغرق وقتًا في ذكر الله والدعاء بعد صلاة الفجر، ويبقى في مكانه حتى طلوع الشمس.
التعليم والوعظ: كثيرًا ما كان يستغل هذا الوقت لتعليم أصحابه وإلقاء النصائح والتوجيهات.
التفاعل مع أصحابه: كان يستمع إلى أصحابه ويتحاور معهم حول مختلف القضايا.
العبادة الشخصية: أحيانًا كان يواصل العبادة بالذكر وقراءة القرآن.
هذه الأنشطة تعكس نمط حياته الذي يجمع بين العبادة والتعليم والتواصل الاجتماعي، وتؤكد على أهمية استغلال الوقت في أمور مفيدة وبناءة.

 

</p>

 </div>

 <div class="container">
  <div class="row justify-content-center">
    <div class="col-md-8 col-lg-6">
      <div class="ratio ratio-16x9">
        <iframe 
          src="https://www.youtube.com/embed/K404uV9xvH8?start=31" 
          title="YouTube video player" 
          allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" 
          allowfullscreen>
        </iframe>
      </div>
    </div>
  </div>
</div>



 <div className="my-4 p-3 border rounded bg-light">
 <h5>كيف كان يتعامل الرسول مع من يؤذيه</h5>
<p>لقد مَلَك النبي صلى الله عليه وسلم بحسن خلقه وجميل عفوه وعظيم حلمه شغافَ القلوب، فقد سبق حلمُه جهلَه، ولم يزده شدة الجهل عليه إلا حلماً، وهذا من عظيم أخلاقه وجميل صفاته، ودلائل نبوته.
ومن ذلك ما رواه أنس بن مالك رضي الله عنه، قال: (كنت أمشي مع رسول الله وعليه ثوب نجراني غليظ الحاشية، فأدركه أعرابي، فجبذ بردائه جبذة شديدة، قال أنس: فنظرت إلى صفحة عاتق النبي وقد أثَّرتْ بها حاشية الرداء من شدة جبذته، ثم قال: يا محمد! مُرْ لي من مال الله الذي عندك، فالتفت إليه فضحك، ثم أَمَر له بعطاء) رواه البخاري.
وبهذا وغيره يعلمنا رسول الله صلى الله عليه وسلم احتمال الجاهلين، والإعراض عن مقابلتهم، ودفع السيئة بالحسنة، وإعطاء من يتألف قلبه، والعفو عن مرتكب كبيرة لا حد فيها بجهله، وإباحة الضحك عند الأمور التي يُتعجب منها في العادة، وفيه كمال خلقه وحلمه وصفحه.
 </p>

 </div>



 <div className="my-4 p-3 border rounded bg-light">
 <h5>كيف كان ينام الرسول</h5>
<p>النوم مبكراً إلا لحاجة والاستيقاظ في الثلث الأخير للقيام: فقد روى البخاري عن أبي برزة أن رسول الله صلى الله عليه وسلم: كان يكره النوم قبل العشاء والحديث بعدها، وكان يقول: «أحب الصلاة إلى الله صلاة داود عليه السلام، وأحب الصيام إلى الله صيام داود، وكان ينام نصف الليل ويقوم ثلثه وينام سدسه، ويصوم يوماً ويفطر يوماً».
الوضوء قبل النوم: لما في الصحيحين أن النبي صلى الله عليه وسلم قال: إذا أتيت مضجعك فتوضأ وضوءك للصلاة…
تعاهد الفراش بنفضه ونحو ذلك: لما رواه البخاري أنه صلى الله عليه وسلم قال: إذا أوى أحدكم إلى فراشه فلينفض فراشه بداخلة إزاره فإنه لا يدري ما خلفه عليه.
أن يضجع على شقة الأيمن: لقول النبي صلى الله عليه وسلم للبراء بن عازب: إذا أتيت مضجعك فتوضأ وضوءك للصلاة ثم اضطجع على شقك الأيمن .
الإتيان بأذكار النوم: كان يجمع كفيه ينفث فيهما، ويقرأ المعوذتين وقل هو الله أحد ثلاث مرات ويمسح بهما وجهه وما استطاع من جسده، ويقرأ آية الكرسي، وأرشد يوماً البراء فقال: «إذا أتيت مضجعك فتوضأ وضوءك للصلاة ثم اضطجع على شقك الأيمن ثم قل: «اللهم إني أسلمت وجهي إليك وفوضت أمري إليك والجأت ظهري إليك رغبة ورهبة إليك لا ملجأ ولا منجا منك إلا إليك، اللهم آمنت بكتابك الذي أنزلت وبنبيك الذي أرسلت. فإن مت من ليلتك فأنت على الفطرة. واجعلهن آخر ما تتكلم به» [متفق عليه].
ووصف ابن القيم في كتابه زاد المعاد ما كان ينام عليه رسول الله: فقد كان ينام على الفراش، وعلى الجلد، وعلى الحصير، وعلى الأرض، وعلى السرير، وعلى كساءٍ أسود، أي أنّه كان ينوّع فيما ينام عليه، ففي يومٍ دخل مجموعةٌ من الصحابة بينهم عمر على رسول الله، فرأى فراشه قد أثّر في جنبه فبكى عمر وقال: (والله إني أعلم أنّك أكرم عند الله من كِسرى وقيْصر، وهما يعبثان ويلهوان في الدنيا، وأنت في هذا المكان)، فقال رسول الله: «أمَا تَرْضى أنْ تكونَ لهمُ الدُّنيا ولنا الآخرةُ؟ قال عمرُ: بَلى، قال: فإنَّه كذاكَ».</p>


 </div>


 <div className="my-4 p-3 border rounded bg-light">
 <h5>كم ساعة كان ينام الرسول</h5>
<p>لم يُحدد بالضبط عدد الساعات التي كان ينامها الرسول محمد صلى الله عليه وسلم، لكن من المعروف من خلال الأحاديث النبوية أنه كان ينام بشكل معتدل وليس بشكل مفرط. كان يستيقظ في الجزء الأخير من الليل لأداء صلاة القيام، مما يشير إلى أنه كان ينام في الليل ويقوم للصلاة قبل الفجر. هذه العادة تعكس التوازن الذي كان يحرص عليه في حياته بين العبادة، الراحة، ومختلف الأنشطة اليومية.</p>


 </div>

 <div className="my-4 p-3 border rounded bg-light">
 <h5>هل كان الرسول يساعد زوجاته في عمل البيت</h5>
<p>كان رسول الله -صلى الله عليه وسلم- في بيته حَسَن الخلق، طيّب المعشر، متواضعاً، يساعد أهله، فقد قالت أم المؤمنين عائشة -رضي الله عنها-: (ما كان إلَّا بشَرًا مِن البشَرِ، كان يَفْلي ثوبَه، ويحلُبُ شاتَه، ويخدُمُ نفسَه)، وعندما يحين موعد الصلاة، يترك ما بيده ويذهب لصلاته، تقول عائشة -رضي الله عنها-: (كانَ يَكونُ في مِهْنَةِ أهْلِهِ – تَعْنِي خِدْمَةَ أهْلِهِ -، فَإِذَا حَضَرَتِ الصَّلَاةُ خَرَجَ إلى الصَّلَاةِ).
وكان يلاطف أهله ويستمع لحديثهن وحسبك بذلك حديث أم المؤمنين عائشة عن نسوة يصفن أزواجهن، زكان أفضلهم رجل يقال له أبو زرع، فقال رسول الله لعائشة رضي الله عنها ملاطفاً: « كنت لك كأبي زرع لأم زرع».</p>


 </div>

 <div className="my-4 p-3 border rounded bg-light">
 <h5>هل كان الرسول يكنس بيته</h5>
<p>نعم، ورد في الأحاديث النبوية أن الرسول محمد صلى الله عليه وسلم كان يشارك في أعمال المنزل ويقوم بأمور مختلفة بما في ذلك كنس بيته. تُظهر هذه الأحاديث تواضعه واهتمامه بمشاركة زوجاته في أعمال المنزل، مما يُعطي مثالاً يحتذى به في السلوك والتوازن بين مختلف جوانب الحياة.</p>


 </div>





 <div className="my-4 p-3 border rounded bg-light">
 <h5>ورد النبي اليومي من القرآن</h5>
<p>لا نعلم في ذلك شيئاً صريحاً صحيحاً، وأقرب ما روي في ذلك حديث أوس بن حذيفة- رضي الله عنه- قال: قدمنا على رسول الله في وفد ثقيف، فكان يأتينا كل ليلة بعد العشاء فيحدثنا قائما على رجليه، فلما كان ذات ليلة أبطأ عن الوقت الذي كان يأتينا فيه، فقلت: يا رسول الله، لقد أبطأت علينا الليلة، قال: «إنه طرأ علي حزبي من القرآن، فكرهت أن أخرج حتى أتمه».

قال أوس: فسألت أصحاب رسول الله: كيف تحزبون القرآن؟ قالوا: ثلاث، وخمس، وسبع، وتسع، وإحدى عشرة، وثلاث عشرة، وحزب المفصل.

والمراد أنهم كانوا يجعلون القرآن سبعة أحزاب:

ثلاث سور: “البقرة وآل عمران والنساء” ولم تعد الفاتحة لقصرها.
خمس: من المائدة إلى التوبة.
سبع: من يونس لغاية النحل.
تسع: من الإسراء لغاية الفرقان.
إحدى عشرة: من الشعراء لغاية يس.
ثلاث عشرة: من الصافات لغاية الحجرات.
حزب المفصل، من سورة ق إلى آخر القرآن.
وكانوا يقرؤون في كل يوم حزباً.

 </p>

 </div>






 <div className="my-4 p-3 border rounded bg-light">
 <h5>يوميات الرسول صلى الله عليه وسلم</h5>
<p>كان النبيّ يسير بين المسلمين يطمئن على أحوالهم، يساعد الملهوف منهم، وينصحهم ويرشدهم، ويردّ السلام عليهم، ويزور مريضهم، ويعينهم على قضاء حوائجهم، ويأمرهم بالمعروف، وينهاهم عن المنكر، يقول أبو هريرة -رضي الله عنه-: أنَّ رَسولَ اللهِ صَلَّى اللَّهُ عليه وسلَّمَ مَرَّ علَى صُبْرَةِ طَعامٍ، فأدْخَلَ يَدَهُ فيها، فَنالَتْ أصابِعُهُ بَلَلًا، فقالَ: «ما هذا يا صاحِبَ الطَّعامِ؟»، قالَ: أصابَتْهُ السَّماءُ يا رَسولَ اللهِ، قالَ: «أفَلا جَعَلْتَهُ فَوْقَ الطَّعامِ كَيْ يَراهُ النَّاسُ، مَن غَشَّ فليسَ مِنِّي».
ووصف عبد الله بن أبي أوفى رسول الله فقال: (كانَ رسولُ اللَّهِ صلَّى اللَّهُ علَيهِ وسلَّمَ يُكْثرُ الذِّكرَ، ويُقلُّ اللَّغوَ، ويطيلُ الصَّلاةَ، ويقصِّرُ الخطبةَ، ولا يأنَفُ أن يمشيَ معَ الأرمَلةِ والمسكينِ، فيَقضيَ لَهُ الحاجةَ).</p>


 </div>



 <div className="my-4 p-3 border rounded bg-light">
 <h5>كيف كان الرسول يقضي يومه</h5>
<p>إذا أردنا أن نقتدي برسول الله صلى الله عليه وسلم ونسير على خطاه، فعلينا بالآتي:

أن نبدأ يومنا بذكر الله تعالى ونختمه به، ونكثر فيه من ذكره سبحانه وتعالى.
أن يكون لنا نصيب في قيام الليل، ولنعلم أن «شرف المؤمن قيام الليل» رواه الحاكم.
ورد من أذكار الصباح والمساء ومن صلاة النافلة ومنها صلاة الضحى.
الحرص على الفرائض في المسجد مع الجماعة.
قضاء اليوم بالأمور النافعة لنا ولأهل بيتنا.
مخالطة المجتمع، ومساعدة المحتاج، وزيارة المريض، والدعوة إلى الله تعالى.
العيش من أجل أمتنا، متعلمين ومعلمين وعاملين مخلصين.</p>


 </div>







</div>




<div className="  mt-5 text-end pb-5 px-2">
      {/* عنوان الكتاب */}
      <h5 className="text-warning fs-3">يوم في حياة الرسول صلى الله عليه وسلم</h5>
      <p className="text-light ">
        يمكنك تحميل أفضل كتب الدكتور <strong>طارق السويدان</strong> الذي يتحدث عن حياة رسول الله ﷺ والإسلام.  
        كتاب <strong>"الإسلام ببساطة"</strong> يمكنك تحميل نسخة <strong>PDF</strong> من الكتاب مجانًا من خلال الرابط أدناه:
      </p>

      {/* زر تحميل الكتاب */}
      <a href="public/images/كتاب الإسلام ببساطة PDF.pdf" download className="btn btn-success btn-lg">
  تحميل الكتاب
</a>


      <hr className="my-4" />

      {/* قسم المراجع */}
      <h5 className="text-warning fs-3 px-2">المراجع</h5>
      <ul className="list-unstyled text-light">
        <li><FaBook className="text-success me-2" /> رواه مسلم، في صحيح مسلم، عن عائشة أم المؤمنين، الصفحة أو الرقم: 719، صحيح.</li>
        <li><FaBook className="text-success me-2" /> رواه السيوطي، في الجامع الصغير، عن أنس بن مالك، الصفحة أو الرقم: 6150، صحيح.</li>
        <li><FaBook className="text-success me-2" /> رواه البخاري، في صحيح البخاري، عن عائشة أم المؤمنين، الصفحة أو الرقم: 6459، صحيح.</li>
        <li><FaBook className="text-success me-2" /> رواه مسلم، في صحيح مسلم، عن أبي هريرة، الصفحة أو الرقم: 102، صحيح.</li>
        <li><FaBook className="text-success me-2" /> رواه الألباني، في صحيح النسائي، عن عبد الله بن أبي أوفى، الصفحة أو الرقم: 1413، صحيح.</li>
      </ul>
    </div>








    </div>
  );
}

export default DayOfDetails;
